Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54P20A.PIC
      <edc:SFRDef edc:_addr="0x46000034" edc:access="-n-----nnnnnnnnn" edc:cname="NISTER" edc:impl="0x41FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDC" edc:desc="Command Complete Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRFC" edc:desc="Transfer Complete Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BLKGE" edc:desc="Block Gap Event Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMAINT" edc:desc="DMA Interrupt Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BWRRDY" edc:desc="Buffer Write Ready Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BRDRDY" edc:desc="Buffer Read Ready Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CINS" edc:desc="Card Insertion Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CREM" edc:desc="Card Removal Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CINT" edc:desc="Card Interrupt Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="BOOTAR" edc:desc="Boot Acknowledge Received Status Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000036" edc:access="---n--nnnnnnnnnn" edc:cname="EISTER" edc:impl="0x13FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDTEO" edc:desc="Command Timeout Error Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDCRC" edc:desc="Command CRC Error Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDEND" edc:desc="Command End Bit Error Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDIDX" edc:desc="Command Index Error Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATTEO" edc:desc="Data Timeout Error Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATCRC" edc:desc="Data CRC Error Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATEND" edc:desc="Data End Bit Error Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURLIM" edc:desc="Current Limit Error Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMD" edc:desc="Auto CMD Error Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADMA" edc:desc="ADMA Error Status Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MASKED" edc:desc="Masked" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTAE" edc:desc="Boot Acknowledge Error Status Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
