Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54P20A.PIC
      <edc:SFRDef edc:_addr="0x46000054" edc:access="-----rrr" edc:cname="AESR" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="ERRST" edc:desc="ADMA Error State" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="ST_STOP (Stop DMA)" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FDS" edc:desc="ST_FDS (Fetch Descriptor)" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="TFR" edc:desc="ST_TFR (Transfer Data)" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LMIS" edc:desc="ADMA Length Mismatch Error" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No Error" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Error" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x46000055" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x46000058" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ASAR0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="ADMASA" edc:desc="ADMA System Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4600005C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x46000060" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR0" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000062" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR1" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000064" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR2" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000066" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR3" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000068" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR4" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600006A" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR5" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600006C" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR6" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600006E" edc:access="nn---nnnnnnnnnnn" edc:cname="PVR7" edc:impl="0xC7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SDCLKFSEL" edc:desc="SDCLK Frequency Select Value for Initialization" edc:nzwidth="0xA"/>
            <edc:SFRFieldDef edc:cname="CLKGSEL" edc:desc="Clock Generator Select Value for Initialization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Host Controller Ver2.00 Compatible Clock Generator (Divider)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PROG" edc:desc="Programmable Clock Generator" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSEL" edc:desc="Driver Strength Select Value for Initialization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="B" edc:desc="Driver Type B is Selected" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="Driver Type A is Selected" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="C" edc:desc="Driver Type C is Selected" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="D" edc:desc="Driver Type D is Selected" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x46000070" edc:offset="0x8C"/>
      <edc:SFRDef edc:_addr="0x460000FC" edc:access="---------------r" edc:cname="SISR" edc:impl="0x1" edc:mclr="100000000000000000" edc:nzwidth="0x10" edc:por="100000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="INTSSL" edc:desc="Interrupt Signal for Each Slot" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x460000FE" edc:access="rrrrrrrrrrrrrrrr" edc:cname="HCVR" edc:mclr="0001100000000010" edc:nzwidth="0x10" edc:por="0001100000000010" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="SVER" edc:desc="Spec Version" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="VVER" edc:desc="Vendor Version" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
