Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54P20A.PIC
      <edc:SFRDef edc:_addr="0xE000ED08" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-------" edc:cname="VTOR" edc:impl="0xFFFFFF80" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TBLOFF" edc:desc="Vector table base offset" edc:nzwidth="0x19"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED0C" edc:access="nnnnnnnnnnnnnnnnn----nnn-----nnn" edc:cname="AIRCR" edc:impl="0xFFFF8707" edc:mclr="11111010000001010000000000000000" edc:nzwidth="0x20" edc:por="11111010000001010000000000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="VECTRESET" edc:desc="Must write 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VECTCLRACTIVE" edc:desc="Must write 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSRESETREQ" edc:desc="System Reset Request" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="No system reset request" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Asserts a signal to the outer system that requests a reset" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PRIGROUP" edc:desc="Interrupt priority grouping" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ENDIANNESS" edc:desc="Data endianness, 0=little, 1=big" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Little-endian" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Big-endian" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VECTKEY" edc:desc="Register key" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED10" edc:access="---------------------------n-nn-" edc:cname="SCR" edc:impl="0x16" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLEEPONEXIT" edc:desc="Sleep-on-exit on handler return" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Do not sleep when returning to Thread mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Enter sleep, or deep sleep, on return from an ISR" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLEEPDEEP" edc:desc="Deep Sleep used as low power mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Sleep" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Deep sleep" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SEVONPEND" edc:desc="Send Event on Pending bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED14" edc:access="----------------------nn---nn-nn" edc:cname="CCR" edc:impl="0x31B" edc:mclr="00000000000000000000001000000000" edc:nzwidth="0x20" edc:por="00000000000000000000001000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="NONBASETHRDENA" edc:desc="Indicates how processor enters Thread mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USERSETMPEND" edc:desc="Enables unprivileged software access to STIR register" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="UNALIGN_TRP" edc:desc="Enables unaligned access traps" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Do not trap unaligned halfword and word accesses" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Trap unaligned halfword and word accesses" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIV_0_TRP" edc:desc="Enables divide by 0 trap" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BFHFNMIGN" edc:desc="Ignore LDM/STM BusFault for -1/-2 priority handlers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STKALIGN" edc:desc="Indicates stack alignment on exception entry" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="4-byte aligned" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="8-byte aligned" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED18" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SHPR1" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="PRI_4" edc:desc="Priority of system handler 4, MemManage" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_5" edc:desc="Priority of system handler 5, BusFault" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_6" edc:desc="Priority of system handler 6, UsageFault" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED1C" edc:access="nnnnnnnn------------------------" edc:cname="SHPR2" edc:impl="0xFF000000" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="PRI_11" edc:desc="Priority of system handler 11, SVCall" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED20" edc:access="nnnnnnnnnnnnnnnn----------------" edc:cname="SHPR3" edc:impl="0xFFFF0000" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="PRI_14" edc:desc="Priority of system handler 14, PendSV" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PRI_15" edc:desc="Priority of system handler 15, SysTick exception" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED24" edc:access="-------------nnnnnnnnn-nn---n-nn" edc:cname="SHCSR" edc:impl="0x7FD8B" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="MEMFAULTACT" edc:desc="MemManage exception active bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSFAULTACT" edc:desc="BusFault exception active bit" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="USGFAULTACT" edc:desc="UsageFault exception active bit" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SVCALLACT" edc:desc="SVCall active bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MONITORACT" edc:desc="DebugMonitor exception active bit" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PENDSVACT" edc:desc="PendSV exception active bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSTICKACT" edc:desc="SysTick exception active bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USGFAULTPENDED" edc:desc="UsageFault exception pending bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MEMFAULTPENDED" edc:desc="MemManage exception pending bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSFAULTPENDED" edc:desc="BusFault exception pending bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SVCALLPENDED" edc:desc="SVCall pending bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MEMFAULTENA" edc:desc="MemManage enable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSFAULTENA" edc:desc="BusFault enable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USGFAULTENA" edc:desc="UsageFault enable bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED28" edc:access="------nn----nnnnn-nnnnnnn-nnn-nn" edc:cname="CFSR" edc:impl="0x30FBFBB" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="IACCVIOL" edc:desc="Instruction access violation" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DACCVIOL" edc:desc="Data access violation" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MUNSTKERR" edc:desc="MemManage Fault on unstacking for exception return" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MSTKERR" edc:desc="MemManage Fault on stacking for exception entry" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLSPERR" edc:desc="MemManager Fault occured during FP lazy state preservation" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MMARVALID" edc:desc="MemManage Fault Address Register valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IBUSERR" edc:desc="Instruction bus error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRECISERR" edc:desc="Precise data bus error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IMPRECISERR" edc:desc="Imprecise data bus error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNSTKERR" edc:desc="BusFault on unstacking for exception return" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STKERR" edc:desc="BusFault on stacking for exception entry" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSPERR" edc:desc="BusFault occured during FP lazy state preservation" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BFARVALID" edc:desc="BusFault Address Register valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDEFINSTR" edc:desc="Undefined instruction UsageFault" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVSTATE" edc:desc="Invalid state UsageFault" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVPC" edc:desc="Invalid PC load UsageFault" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOCP" edc:desc="No coprocessor UsageFault" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="UNALIGNED" edc:desc="Unaligned access UsageFault" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIVBYZERO" edc:desc="Divide by zero UsageFault" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED2C" edc:access="nn----------------------------n-" edc:cname="HFSR" edc:impl="0xC0000002" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VECTTBL" edc:desc="BusFault on a Vector Table read during exception processing" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1C"/>
            <edc:SFRFieldDef edc:cname="FORCED" edc:desc="Forced Hard Fault" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DEBUGEVT" edc:desc="Debug: always write 0" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED30" edc:access="---------------------------nnnnn" edc:cname="DFSR" edc:impl="0x1F" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="HALTED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BKPT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DWTTRAP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXTERNAL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
